class HizbData {
  static const Map<int, List<Map<String, dynamic>>> pageHizbs = {
    1: [
      {'text': 'الْحِزْب 1', 'line': 2},
    ],
    5: [
      {'text': 'رُبْع الْحِزْب 1', 'line': 5},
    ],
    7: [
      {'text': 'نِصْف الْحِزْب 1', 'line': 9},
    ],
    9: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 1', 'line': 5},
    ],
    11: [
      {'text': 'الْحِزْب 2', 'line': 11},
    ],
    14: [
      {'text': 'رُبْع الْحِزْب 2', 'line': 10},
    ],
    17: [
      {'text': 'نِصْف الْحِزْب 2', 'line': 1},
    ],
    19: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 2', 'line': 8},
    ],
    22: [
      {'text': 'الْحِزْب 3', 'line': 1},
    ],
    24: [
      {'text': 'رُبْع الْحِزْب 3', 'line': 6},
    ],
    27: [
      {'text': 'نِصْف الْحِزْب 3', 'line': 1},
    ],
    29: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 3', 'line': 10},
    ],
    32: [
      {'text': 'الْحِزْب 4', 'line': 1},
    ],
    34: [
      {'text': 'رُبْع الْحِزْب 4', 'line': 12},
    ],
    37: [
      {'text': 'نِصْف الْحِزْب 4', 'line': 9},
    ],
    39: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 4', 'line': 9},
    ],
    42: [
      {'text': 'الْحِزْب 5', 'line': 1},
    ],
    44: [
      {'text': 'رُبْع الْحِزْب 5', 'line': 10},
    ],
    46: [
      {'text': 'نِصْف الْحِزْب 5', 'line': 5},
    ],
    49: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 5', 'line': 1},
    ],
    51: [
      {'text': 'الْحِزْب 6', 'line': 12},
    ],
    54: [
      {'text': 'رُبْع الْحِزْب 6', 'line': 6},
    ],
    56: [
      {'text': 'نِصْف الْحِزْب 6', 'line': 13},
    ],
    59: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 6', 'line': 8},
    ],
    62: [
      {'text': 'الْحِزْب 7', 'line': 2},
    ],
    64: [
      {'text': 'رُبْع الْحِزْب 7', 'line': 10},
    ],
    67: [
      {'text': 'نِصْف الْحِزْب 7', 'line': 1},
    ],
    69: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 7', 'line': 12},
    ],
    72: [
      {'text': 'الْحِزْب 8', 'line': 11},
    ],
    74: [
      {'text': 'رُبْع الْحِزْب 8', 'line': 12},
    ],
    77: [
      {'text': 'نِصْف الْحِزْب 8', 'line': 2},
    ],
    79: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 8', 'line': 1},
    ],
    82: [
      {'text': 'الْحِزْب 9', 'line': 1},
    ],
    84: [
      {'text': 'رُبْع الْحِزْب 9', 'line': 9},
    ],
    87: [
      {'text': 'نِصْف الْحِزْب 9', 'line': 10},
    ],
    89: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 9', 'line': 13},
    ],
    92: [
      {'text': 'الْحِزْب 10', 'line': 2},
    ],
    94: [
      {'text': 'رُبْع الْحِزْب 10', 'line': 11},
    ],
    97: [
      {'text': 'نِصْف الْحِزْب 10', 'line': 1},
    ],
    100: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 10', 'line': 1},
    ],
    102: [
      {'text': 'الْحِزْب 11', 'line': 1},
    ],
    104: [
      {'text': 'رُبْع الْحِزْب 11', 'line': 1},
    ],
    106: [
      {'text': 'نِصْف الْحِزْب 11', 'line': 8},
    ],
    109: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 11', 'line': 5},
    ],
    112: [
      {'text': 'الْحِزْب 12', 'line': 6},
    ],
    114: [
      {'text': 'رُبْع الْحِزْب 12', 'line': 7},
    ],
    117: [
      {'text': 'نِصْف الْحِزْب 12', 'line': 1},
    ],
    119: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 12', 'line': 5},
    ],
    121: [
      {'text': 'الْحِزْب 13', 'line': 12},
    ],
    124: [
      {'text': 'رُبْع الْحِزْب 13', 'line': 3},
    ],
    126: [
      {'text': 'نِصْف الْحِزْب 13', 'line': 1},
    ],
    129: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 13', 'line': 8},
    ],
    132: [
      {'text': 'الْحِزْب 14', 'line': 1},
    ],
    134: [
      {'text': 'رُبْع الْحِزْب 14', 'line': 13},
    ],
    137: [
      {'text': 'نِصْف الْحِزْب 14', 'line': 1},
    ],
    140: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 14', 'line': 1},
    ],
    142: [
      {'text': 'الْحِزْب 15', 'line': 1},
    ],
    144: [
      {'text': 'رُبْع الْحِزْب 15', 'line': 5},
    ],
    146: [
      {'text': 'نِصْف الْحِزْب 15', 'line': 9},
    ],
    148: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 15', 'line': 10},
    ],
    151: [
      {'text': 'الْحِزْب 16', 'line': 3},
    ],
    154: [
      {'text': 'رُبْع الْحِزْب 16', 'line': 1},
    ],
    156: [
      {'text': 'نِصْف الْحِزْب 16', 'line': 6},
    ],
    158: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 16', 'line': 11},
    ],
    162: [
      {'text': 'الْحِزْب 17', 'line': 1},
    ],
    164: [
      {'text': 'رُبْع الْحِزْب 17', 'line': 13},
    ],
    167: [
      {'text': 'نِصْف الْحِزْب 17', 'line': 8},
    ],
    170: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 17', 'line': 1},
    ],
    173: [
      {'text': 'الْحِزْب 18', 'line': 1},
    ],
    175: [
      {'text': 'رُبْع الْحِزْب 18', 'line': 3},
    ],
    177: [
      {'text': 'نِصْف الْحِزْب 18', 'line': 3},
    ],
    179: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 18', 'line': 9},
    ],
    182: [
      {'text': 'الْحِزْب 19', 'line': 1},
    ],
    184: [
      {'text': 'رُبْع الْحِزْب 19', 'line': 14},
    ],
    187: [
      {'text': 'نِصْف الْحِزْب 19', 'line': 2},
    ],
    189: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 19', 'line': 11},
    ],
    192: [
      {'text': 'الْحِزْب 20', 'line': 4},
    ],
    194: [
      {'text': 'رُبْع الْحِزْب 20', 'line': 11},
    ],
    196: [
      {'text': 'نِصْف الْحِزْب 20', 'line': 9},
    ],
    199: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 20', 'line': 7},
    ],
    201: [
      {'text': 'الْحِزْب 21', 'line': 13},
    ],
    204: [
      {'text': 'رُبْع الْحِزْب 21', 'line': 11},
    ],
    206: [
      {'text': 'نِصْف الْحِزْب 21', 'line': 13},
    ],
    209: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 21', 'line': 7},
    ],
    212: [
      {'text': 'الْحِزْب 22', 'line': 1},
    ],
    214: [
      {'text': 'رُبْع الْحِزْب 22', 'line': 14},
    ],
    217: [
      {'text': 'نِصْف الْحِزْب 22', 'line': 1},
    ],
    219: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 22', 'line': 2},
    ],
    222: [
      {'text': 'الْحِزْب 23', 'line': 1},
    ],
    224: [
      {'text': 'رُبْع الْحِزْب 23', 'line': 7},
    ],
    226: [
      {'text': 'نِصْف الْحِزْب 23', 'line': 6},
    ],
    228: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 23', 'line': 11},
    ],
    231: [
      {'text': 'الْحِزْب 24', 'line': 3},
    ],
    233: [
      {'text': 'رُبْع الْحِزْب 24', 'line': 14},
    ],
    236: [
      {'text': 'نِصْف الْحِزْب 24', 'line': 5},
    ],
    238: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 24', 'line': 14},
    ],
    242: [
      {'text': 'الْحِزْب 25', 'line': 1},
    ],
    244: [
      {'text': 'رُبْع الْحِزْب 25', 'line': 11},
    ],
    247: [
      {'text': 'نِصْف الْحِزْب 25', 'line': 10},
    ],
    249: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 25', 'line': 13},
    ],
    252: [
      {'text': 'الْحِزْب 26', 'line': 1},
    ],
    254: [
      {'text': 'رُبْع الْحِزْب 26', 'line': 1},
    ],
    256: [
      {'text': 'نِصْف الْحِزْب 26', 'line': 11},
    ],
    259: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 26', 'line': 6},
    ],
    262: [
      {'text': 'الْحِزْب 27', 'line': 3},
    ],
    264: [
      {'text': 'رُبْع الْحِزْب 27', 'line': 14},
    ],
    267: [
      {'text': 'نِصْف الْحِزْب 27', 'line': 9},
    ],
    270: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 27', 'line': 6},
    ],
    272: [
      {'text': 'الْحِزْب 28', 'line': 11},
    ],
    275: [
      {'text': 'رُبْع الْحِزْب 28', 'line': 3},
    ],
    277: [
      {'text': 'نِصْف الْحِزْب 28', 'line': 5},
    ],
    280: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 28', 'line': 1},
    ],
    282: [
      {'text': 'الْحِزْب 29', 'line': 3},
    ],
    284: [
      {'text': 'رُبْع الْحِزْب 29', 'line': 8},
    ],
    287: [
      {'text': 'نِصْف الْحِزْب 29', 'line': 1},
    ],
    289: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 29', 'line': 6},
    ],
    292: [
      {'text': 'الْحِزْب 30', 'line': 5},
    ],
    295: [
      {'text': 'رُبْع الْحِزْب 30', 'line': 3},
    ],
    297: [
      {'text': 'نِصْف الْحِزْب 30', 'line': 11},
    ],
    299: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 30', 'line': 11},
    ],
    302: [
      {'text': 'الْحِزْب 31', 'line': 1},
    ],
    304: [
      {'text': 'رُبْع الْحِزْب 31', 'line': 2},
    ],
    306: [
      {'text': 'نِصْف الْحِزْب 31', 'line': 11},
    ],
    309: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 31', 'line': 8},
    ],
    312: [
      {'text': 'الْحِزْب 32', 'line': 7},
    ],
    315: [
      {'text': 'رُبْع الْحِزْب 32', 'line': 4},
    ],
    317: [
      {'text': 'نِصْف الْحِزْب 32', 'line': 8},
    ],
    319: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 32', 'line': 12},
    ],
    322: [
      {'text': 'الْحِزْب 33', 'line': 3},
    ],
    324: [
      {'text': 'رُبْع الْحِزْب 33', 'line': 6},
    ],
    326: [
      {'text': 'نِصْف الْحِزْب 33', 'line': 9},
    ],
    329: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 33', 'line': 2},
    ],
    332: [
      {'text': 'الْحِزْب 34', 'line': 2},
    ],
    334: [
      {'text': 'رُبْع الْحِزْب 34', 'line': 8},
    ],
    336: [
      {'text': 'نِصْف الْحِزْب 34', 'line': 14},
    ],
    339: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 34', 'line': 7},
    ],
    342: [
      {'text': 'الْحِزْب 35', 'line': 2},
    ],
    344: [
      {'text': 'رُبْع الْحِزْب 35', 'line': 10},
    ],
    347: [
      {'text': 'نِصْف الْحِزْب 35', 'line': 1},
    ],
    350: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 35', 'line': 2},
    ],
    352: [
      {'text': 'الْحِزْب 36', 'line': 1},
    ],
    354: [
      {'text': 'رُبْع الْحِزْب 36', 'line': 9},
    ],
    356: [
      {'text': 'نِصْف الْحِزْب 36', 'line': 14},
    ],
    359: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 36', 'line': 13},
    ],
    362: [
      {'text': 'الْحِزْب 37', 'line': 1},
    ],
    364: [
      {'text': 'رُبْع الْحِزْب 37', 'line': 11},
    ],
    367: [
      {'text': 'نِصْف الْحِزْب 37', 'line': 2},
    ],
    369: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 37', 'line': 11},
    ],
    371: [
      {'text': 'الْحِزْب 38', 'line': 15},
    ],
    374: [
      {'text': 'رُبْع الْحِزْب 38', 'line': 13},
    ],
    377: [
      {'text': 'نِصْف الْحِزْب 38', 'line': 2},
    ],
    379: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 38', 'line': 6},
    ],
    382: [
      {'text': 'الْحِزْب 39', 'line': 1},
    ],
    384: [
      {'text': 'رُبْع الْحِزْب 39', 'line': 5},
    ],
    386: [
      {'text': 'نِصْف الْحِزْب 39', 'line': 12},
    ],
    389: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 39', 'line': 1},
    ],
    392: [
      {'text': 'الْحِزْب 40', 'line': 1},
    ],
    394: [
      {'text': 'رُبْع الْحِزْب 40', 'line': 10},
    ],
    396: [
      {'text': 'نِصْف الْحِزْب 40', 'line': 10},
    ],
    399: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 40', 'line': 6},
    ],
    402: [
      {'text': 'الْحِزْب 41', 'line': 1},
    ],
    404: [
      {'text': 'رُبْع الْحِزْب 41', 'line': 12},
    ],
    407: [
      {'text': 'نِصْف الْحِزْب 41', 'line': 13},
    ],
    410: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 41', 'line': 4},
    ],
    413: [
      {'text': 'الْحِزْب 42', 'line': 5},
    ],
    415: [
      {'text': 'رُبْع الْحِزْب 42', 'line': 14},
    ],
    418: [
      {'text': 'نِصْف الْحِزْب 42', 'line': 2},
    ],
    420: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 42', 'line': 4},
    ],
    422: [
      {'text': 'الْحِزْب 43', 'line': 1},
    ],
    425: [
      {'text': 'رُبْع الْحِزْب 43', 'line': 1},
    ],
    426: [
      {'text': 'نِصْف الْحِزْب 43', 'line': 11},
    ],
    429: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 43', 'line': 5},
    ],
    431: [
      {'text': 'الْحِزْب 44', 'line': 3},
    ],
    433: [
      {'text': 'رُبْع الْحِزْب 44', 'line': 11},
    ],
    436: [
      {'text': 'نِصْف الْحِزْب 44', 'line': 10},
    ],
    439: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 44', 'line': 6},
    ],
    442: [
      {'text': 'الْحِزْب 45', 'line': 1},
    ],
    444: [
      {'text': 'رُبْع الْحِزْب 45', 'line': 4},
    ],
    446: [
      {'text': 'نِصْف الْحِزْب 45', 'line': 14},
    ],
    449: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 45', 'line': 3},
    ],
    451: [
      {'text': 'الْحِزْب 46', 'line': 10},
    ],
    454: [
      {'text': 'رُبْع الْحِزْب 46', 'line': 4},
    ],
    456: [
      {'text': 'نِصْف الْحِزْب 46', 'line': 9},
    ],
    459: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 46', 'line': 8},
    ],
    462: [
      {'text': 'الْحِزْب 47', 'line': 1},
    ],
    464: [
      {'text': 'رُبْع الْحِزْب 47', 'line': 9},
    ],
    467: [
      {'text': 'نِصْف الْحِزْب 47', 'line': 5},
    ],
    469: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 47', 'line': 6},
    ],
    472: [
      {'text': 'الْحِزْب 48', 'line': 1},
    ],
    474: [
      {'text': 'رُبْع الْحِزْب 48', 'line': 13},
    ],
    477: [
      {'text': 'نِصْف الْحِزْب 48', 'line': 11},
    ],
    479: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 48', 'line': 7},
    ],
    482: [
      {'text': 'الْحِزْب 49', 'line': 1},
    ],
    484: [
      {'text': 'رُبْع الْحِزْب 49', 'line': 5},
    ],
    486: [
      {'text': 'نِصْف الْحِزْب 49', 'line': 8},
    ],
    488: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 49', 'line': 13},
    ],
    491: [
      {'text': 'الْحِزْب 50', 'line': 3},
    ],
    493: [
      {'text': 'رُبْع الْحِزْب 50', 'line': 11},
    ],
    496: [
      {'text': 'نِصْف الْحِزْب 50', 'line': 14},
    ],
    499: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 50', 'line': 13},
    ],
    502: [
      {'text': 'الْحِزْب 51', 'line': 9},
    ],
    505: [
      {'text': 'رُبْع الْحِزْب 51', 'line': 1},
    ],
    507: [
      {'text': 'نِصْف الْحِزْب 51', 'line': 13},
    ],
    510: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 51', 'line': 6},
    ],
    513: [
      {'text': 'الْحِزْب 52', 'line': 6},
    ],
    515: [
      {'text': 'رُبْع الْحِزْب 52', 'line': 9},
    ],
    517: [
      {'text': 'نِصْف الْحِزْب 52', 'line': 6},
    ],
    519: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 52', 'line': 9},
    ],
    522: [
      {'text': 'الْحِزْب 53', 'line': 1},
    ],
    524: [
      {'text': 'رُبْع الْحِزْب 53', 'line': 9},
    ],
    526: [
      {'text': 'نِصْف الْحِزْب 53', 'line': 14},
    ],
    529: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 53', 'line': 2},
    ],
    531: [
      {'text': 'الْحِزْب 54', 'line': 7},
    ],
    534: [
      {'text': 'رُبْع الْحِزْب 54', 'line': 9},
    ],
    536: [
      {'text': 'نِصْف الْحِزْب 54', 'line': 14},
    ],
    539: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 54', 'line': 10},
    ],
    542: [
      {'text': 'الْحِزْب 55', 'line': 3},
    ],
    544: [
      {'text': 'رُبْع الْحِزْب 55', 'line': 5},
    ],
    547: [
      {'text': 'نِصْف الْحِزْب 55', 'line': 3},
    ],
    550: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 55', 'line': 2},
    ],
    553: [
      {'text': 'الْحِزْب 56', 'line': 3},
    ],
    554: [
      {'text': 'رُبْع الْحِزْب 56', 'line': 13},
    ],
    558: [
      {'text': 'نِصْف الْحِزْب 56', 'line': 2},
    ],
    560: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 56', 'line': 3},
    ],
    562: [
      {'text': 'الْحِزْب 57', 'line': 3},
    ],
    564: [
      {'text': 'رُبْع الْحِزْب 57', 'line': 8},
    ],
    566: [
      {'text': 'نِصْف الْحِزْب 57', 'line': 11},
    ],
    569: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 57', 'line': 4},
    ],
    572: [
      {'text': 'الْحِزْب 58', 'line': 3},
    ],
    575: [
      {'text': 'رُبْع الْحِزْب 58', 'line': 1},
    ],
    577: [
      {'text': 'نِصْف الْحِزْب 58', 'line': 8},
    ],
    579: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 58', 'line': 10},
    ],
    582: [
      {'text': 'الْحِزْب 59', 'line': 3},
    ],
    585: [
      {'text': 'رُبْع الْحِزْب 59', 'line': 2},
    ],
    587: [
      {'text': 'نِصْف الْحِزْب 59', 'line': 2},
    ],
    589: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 59', 'line': 4},
    ],
    591: [
      {'text': 'الْحِزْب 60', 'line': 10},
    ],
    594: [
      {'text': 'رُبْع الْحِزْب 60', 'line': 6},
    ],
    596: [
      {'text': 'نِصْف الْحِزْب 60', 'line': 13},
    ],
    599: [
      {'text': 'ثَلَاثَةُ أَرْبَاعِ الْحِزْب 60', 'line': 15},
    ],
  };
}
